<a href="https://colab.research.google.com/github/minimanin/ai-study/blob/master/05_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# Series, DataFrame

In [2]:
from pandas import Series, DataFrame
import pandas as pd

In [3]:
# !pip install pandas

In [4]:
fruit = Series([2500, 3800, 1200, 6000], index=['apple', 'banana', 'pear', 'cherry'])

In [5]:
print(fruit)

apple     2500
banana    3800
pear      1200
cherry    6000
dtype: int64

In [6]:
 print(fruit.values)

[2500 3800 1200 6000]

In [7]:
print(fruit.index)

Index(['apple', 'banana', 'pear', 'cherry'], dtype='object')

In [8]:
fruitData = {'apple':2500, 'banana':3800, 'pear':1200, 'cherry':6000}

In [9]:
type(fruitData)

dict

In [10]:
fruit = Series(fruitData)

In [11]:
fruit.name = 'fruitPrice'

In [12]:
fruit

apple     2500
banana    3800
pear      1200
cherry    6000
Name: fruitPrice, dtype: int64

In [13]:
fruit.index.name = 'fruitPrice'

In [14]:
fruit

fruitPrice
apple     2500
banana    3800
pear      1200
cherry    6000
Name: fruitPrice, dtype: int64

In [15]:
# Dataframe

In [16]:
fruitData = {'fruitName':['apple', 'banana', 'cherry', 'pear'],
             'fruitPrice':[2500, 2800, 6000, 1200],
             'num':[10,5,3,8]
             }

In [17]:
type(fruitData)

dict

In [18]:
fruitFrame = DataFrame(fruitData)

In [19]:
fruitFrame

  fruitName  fruitPrice  num
0     apple        2500   10
1    banana        2800    5
2    cherry        6000    3
3      pear        1200    8

In [20]:
fruitFrame = DataFrame(fruitData, columns=['fruitPrice', 'num', 'fruitName'])

In [21]:
fruitFrame

   fruitPrice  num fruitName
0        2500   10     apple
1        2800    5    banana
2        6000    3    cherry
3        1200    8      pear

In [22]:
fruitFrame['fruitName']

0     apple
1    banana
2    cherry
3      pear
Name: fruitName, dtype: object

In [23]:
fruitFrame.fruitName

0     apple
1    banana
2    cherry
3      pear
Name: fruitName, dtype: object

In [24]:
fruitFrame['Year']='2016'

In [25]:
fruitFrame

   fruitPrice  num fruitName  Year
0        2500   10     apple  2016
1        2800    5    banana  2016
2        6000    3    cherry  2016
3        1200    8      pear  2016

In [26]:
variable = Series([4,2,1], index = [0,2,3])

In [27]:
fruitFrame['stock'] = variable

In [28]:
fruitFrame

   fruitPrice  num fruitName  Year  stock
0        2500   10     apple  2016    4.0
1        2800    5    banana  2016    NaN
2        6000    3    cherry  2016    2.0
3        1200    8      pear  2016    1.0

In [29]:
fruit = Series([2500, 3800, 1200, 6000], index=['apple', 'banana', 'pear', 'cherry'])

In [30]:
new_fruit = fruit.drop('banana')

In [31]:
new_fruit

apple     2500
pear      1200
cherry    6000
dtype: int64

In [32]:
fruitData = {'fruitName':['apple', 'banana', 'pear', 'cherry'], 'fruitPrice':[2500, 3800, 6000, 1200], 'num':[10,5,3,8]}

In [33]:
fruitName = fruitData['fruitName']

In [34]:
fruitName

['apple', 'banana', 'pear', 'cherry']

In [35]:
fruitFrame = DataFrame(fruitData, index = fruitName, columns=['fruitPrice', 'num'])

In [36]:
fruitFrame

        fruitPrice  num
apple         2500   10
banana        3800    5
pear          6000    3
cherry        1200    8

In [37]:
fruitFrame2 = fruitFrame.drop(['apple', 'cherry'])

In [38]:
fruitFrame2

        fruitPrice  num
banana        3800    5
pear          6000    3

In [39]:
fruitFrame3 = fruitFrame.drop(['num'], axis=1)

In [40]:
fruitFrame3

        fruitPrice
apple         2500
banana        3800
pear          6000
cherry        1200

In [41]:
fruitFrame['apple':'pear']

        fruitPrice  num
apple         2500   10
banana        3800    5
pear          6000    3

In [42]:
a = [1,2,3,4,5]

In [43]:
b = a[:]

In [44]:
b[0] = 916

In [45]:
b

[916, 2, 3, 4, 5]

In [46]:
a

[1, 2, 3, 4, 5]

In [47]:
fruitFrame['fruitPrice']

apple     2500
banana    3800
pear      6000
cherry    1200
Name: fruitPrice, dtype: int64

In [48]:
fruit1 = Series([5,9,10,3], index=['apple', 'banana', 'cherry', 'pear'])

In [49]:
fruit2 = Series([3,2,9,5,10], index=['apple', 'orange', 'banana', 'cherry', 'mango'])

In [50]:
fruit1

apple      5
banana     9
cherry    10
pear       3
dtype: int64

In [51]:
fruit2

apple      3
orange     2
banana     9
cherry     5
mango     10
dtype: int64

In [52]:
fruit1 + fruit2

apple      8.0
banana    18.0
cherry    15.0
mango      NaN
orange     NaN
pear       NaN
dtype: float64

In [53]:
fruitFrame['fruitPrice'].sort_values(ascending=True)

cherry    1200
apple     2500
banana    3800
pear      6000
Name: fruitPrice, dtype: int64

In [54]:
fruitFrame.sort_index()

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        1200    8
pear          6000    3

In [55]:
fruitFrame.sort_values(by=['fruitPrice', 'num'])

        fruitPrice  num
cherry        1200    8
apple         2500   10
banana        3800    5
pear          6000    3

In [58]:
german = pd.read_csv('http://freakonometrics.free.fr/german_credit.csv')

In [59]:
german.columns.values

array(['Creditability', 'Account Balance', 'Duration of Credit (month)',
       'Payment Status of Previous Credit', 'Purpose', 'Credit Amount',
       'Value Savings/Stocks', 'Length of current employment',
       'Instalment per cent', 'Sex & Marital Status', 'Guarantors',
       'Duration in Current address', 'Most valuable available asset',
       'Age (years)', 'Concurrent Credits', 'Type of apartment',
       'No of Credits at this Bank', 'Occupation', 'No of dependents',
       'Telephone', 'Foreign Worker'], dtype=object)

In [61]:
german_sample = german[['Creditability', 'Duration of Credit (month)', 'Purpose', 'Credit Amount']]

In [62]:
german_sample

     Creditability  Duration of Credit (month)  Purpose  Credit Amount
0                1                          18        2           1049
1                1                           9        0           2799
2                1                          12        9            841
3                1                          12        0           2122
4                1                          12        0           2171
..             ...                         ...      ...            ...
995              0                          24        3           1987
996              0                          24        0           2303
997              0                          21        0          12680
998              0                          12        3           6468
999              0                          30        2           6350

[1000 rows x 4 columns]

In [63]:
german_sample.min()

Creditability                   0
Duration of Credit (month)      4
Purpose                         0
Credit Amount                 250
dtype: int64

In [64]:
german_sample.max()

Creditability                     1
Duration of Credit (month)       72
Purpose                          10
Credit Amount                 18424
dtype: int64

In [65]:
german_sample.mean()

Creditability                    0.700
Duration of Credit (month)      20.903
Purpose                          2.828
Credit Amount                 3271.248
dtype: float64

In [66]:
german_sample.describe

<bound method NDFrame.describe of      Creditability  Duration of Credit (month)  Purpose  Credit Amount
0                1                          18        2           1049
1                1                           9        0           2799
2                1                          12        9            841
3                1                          12        0           2122
4                1                          12        0           2171
..             ...                         ...      ...            ...
995              0                          24        3           1987
996              0                          24        0           2303
997              0                          21        0          12680
998              0                          12        3           6468
999              0                          30        2           6350

[1000 rows x 4 columns]>

In [67]:
german_sample = german[['Duration of Credit (month)', 'Credit Amount', 'Age (years)']]

In [68]:
german_sample.head

<bound method NDFrame.head of      Duration of Credit (month)  Credit Amount  Age (years)
0                            18           1049           21
1                             9           2799           36
2                            12            841           23
3                            12           2122           39
4                            12           2171           38
..                          ...            ...          ...
995                          24           1987           21
996                          24           2303           45
997                          21          12680           30
998                          12           6468           52
999                          30           6350           31

[1000 rows x 3 columns]>

In [70]:
german_sample.corr() # Correlation

                            Duration of Credit (month)  ...  Age (years)
Duration of Credit (month)                    1.000000  ...    -0.037550
Credit Amount                                 0.624988  ...     0.032273
Age (years)                                  -0.037550  ...     1.000000

[3 rows x 3 columns]

In [71]:
# Group by

In [72]:
german_sample = german[['Credit Amount', 'Type of apartment']]

In [73]:
german_sample

     Credit Amount  Type of apartment
0             1049                  1
1             2799                  1
2              841                  1
3             2122                  1
4             2171                  2
..             ...                ...
995           1987                  1
996           2303                  2
997          12680                  3
998           6468                  2
999           6350                  2

[1000 rows x 2 columns]

In [78]:
german_grouped = german_sample['Credit Amount'].groupby(german_sample['Type of apartment'])

In [79]:
german_grouped.mean()

Type of apartment
1    3122.553073
2    3067.257703
3    4881.205607
Name: Credit Amount, dtype: float64

In [80]:
german_grouped.sum()

Type of apartment
1     558937
2    2190022
3     522289
Name: Credit Amount, dtype: int64

In [82]:
german_sample = german[['Credit Amount', 'Type of apartment', 'Purpose']]

In [83]:
german_grouped2 = german_sample['Credit Amount'].groupby([german_sample['Purpose'], german_sample['Type of apartment']])

In [85]:
german_grouped2.mean()

Purpose  Type of apartment
0        1                    2597.225000
         2                    2811.024242
         3                    5138.689655
1        1                    5037.086957
         2                    4915.222222
         3                    6609.923077
2        1                    2727.354167
         2                    3107.450820
         3                    4100.181818
3        1                    2199.763158
         2                    2540.533040
         3                    2417.333333
4        1                    1255.500000
         2                    1546.500000
5        1                    1522.000000
         2                    2866.000000
         3                    2750.666667
6        1                    3156.444444
         2                    2492.423077
         3                    4387.266667
8        1                     902.000000
         2                    1243.875000
9        1                    5614.125000
         2                    3800.592105
         3                    4931.800000
10       2                    8576.111111
         3                    7109.000000
Name: Credit Amount, dtype: float64

In [86]:
import seaborn as sns

In [87]:
planets = sns.load_dataset('planets')

In [88]:
planets

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [89]:
planets.dropna()

              method  number  orbital_period    mass  distance  year
0    Radial Velocity       1       269.30000   7.100     77.40  2006
1    Radial Velocity       1       874.77400   2.210     56.95  2008
2    Radial Velocity       1       763.00000   2.600     19.84  2011
3    Radial Velocity       1       326.03000  19.400    110.62  2007
4    Radial Velocity       1       516.22000  10.500    119.47  2009
..               ...     ...             ...     ...       ...   ...
640  Radial Velocity       1       111.70000   2.100     14.90  2009
641  Radial Velocity       1         5.05050   1.068     44.46  2013
642  Radial Velocity       1       311.28800   1.940     17.24  1999
649          Transit       1         2.70339   1.470    178.00  2013
784  Radial Velocity       3       580.00000   0.947    135.00  2012

[498 rows x 6 columns]

In [90]:
births = pd.read_csv('https://raw.githubusercontent.com/jakevdp/data-CDCbirths/master/births.csv')

In [91]:
births

       year  month  day gender  births
0      1969      1  1.0      F    4046
1      1969      1  1.0      M    4440
2      1969      1  2.0      F    4454
3      1969      1  2.0      M    4548
4      1969      1  3.0      F    4548
...     ...    ...  ...    ...     ...
15542  2008     10  NaN      M  183219
15543  2008     11  NaN      F  158939
15544  2008     11  NaN      M  165468
15545  2008     12  NaN      F  173215
15546  2008     12  NaN      M  181235

[15547 rows x 5 columns]

In [92]:
births.head

<bound method NDFrame.head of        year  month  day gender  births
0      1969      1  1.0      F    4046
1      1969      1  1.0      M    4440
2      1969      1  2.0      F    4454
3      1969      1  2.0      M    4548
4      1969      1  3.0      F    4548
...     ...    ...  ...    ...     ...
15542  2008     10  NaN      M  183219
15543  2008     11  NaN      F  158939
15544  2008     11  NaN      M  165468
15545  2008     12  NaN      F  173215
15546  2008     12  NaN      M  181235

[15547 rows x 5 columns]>

In [93]:
births['decade'] = births['year'] // 10 * 10

In [95]:
births

       year  month  day gender  births  decade
0      1969      1  1.0      F    4046    1960
1      1969      1  1.0      M    4440    1960
2      1969      1  2.0      F    4454    1960
3      1969      1  2.0      M    4548    1960
4      1969      1  3.0      F    4548    1960
...     ...    ...  ...    ...     ...     ...
15542  2008     10  NaN      M  183219    2000
15543  2008     11  NaN      F  158939    2000
15544  2008     11  NaN      M  165468    2000
15545  2008     12  NaN      F  173215    2000
15546  2008     12  NaN      M  181235    2000

[15547 rows x 6 columns]

In [96]:
births.pivot_table('births', index='decade', columns='gender', aggfunc='sum')

gender         F         M
decade
1960     1753634   1846572
1970    16263075  17121550
1980    18310351  19243452
1990    19479454  20420553
2000    18229309  19106428